Revit 2027 API
UIView.Close Method
 Closes the view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Close()
Public Sub Close
public:
void Close()
member Close : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Cannot close a project's only open view.
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace